In [2]:
import pandas as pd

/Users/Vikas/anaconda3/envs/PythonData/lib/python3.6/importlib/_bootstrap.py:219: RuntimeWarning: numpy.dtype size changed, may indicate binary incompatibility. Expected 96, got 88
  return f(*args, **kwds)

In [3]:
DF_MWS=pd.read_excel('MWS.xlsx')
DF_TTS=pd.read_excel('TTS.xlsx')
DF_MWS_LookUP=pd.read_excel('MWS_Stu_Lookup.xlsx')
DF_TTS_LookUP=pd.read_excel('TTS_Stu_Lookup.xlsx')

In [4]:
DF_MWS.head(2)

  Batch  StudentId HomeWork  Score
0   MWS          1    Excel     74
1   MWS          2    Excel     65

In [5]:
DF_MWS.set_index('StudentId').head(2)

          Batch HomeWork  Score
StudentId
1           MWS    Excel     74
2           MWS    Excel     65

In [6]:
#Reset the index, moves the index column as a new column 
DF_MWS.reset_index().head(2)

   index Batch  StudentId HomeWork  Score
0      0   MWS          1    Excel     74
1      1   MWS          2    Excel     65

In [7]:
#Reset the index, this time with additional parameter of "drop=True" 
DF_MWS.reset_index(drop=True).head(2)

  Batch  StudentId HomeWork  Score
0   MWS          1    Excel     74
1   MWS          2    Excel     65

In [8]:
#A group by just creates a iterable group by object that can be iterated over
DF_MWS.groupby(['HomeWork'])

In [9]:
#Displaying teh contents of Group using List
list(DF_MWS.groupby(['HomeWork']))

[('Excel',   Batch  StudentId HomeWork  Score
  0   MWS          1    Excel     74
  1   MWS          2    Excel     65
  2   MWS          3    Excel     84
  3   MWS          4    Excel     79
  4   MWS          5    Excel     72
  5   MWS          6    Excel     56
  6   MWS          7    Excel     82
  7   MWS          8    Excel     98
  8   MWS          9    Excel     76
  9   MWS         10    Excel     89),
 ('PANDAS',    Batch  StudentId HomeWork  Score
  30   MWS          1   PANDAS     69
  31   MWS          2   PANDAS    100
  32   MWS          3   PANDAS     91
  33   MWS          4   PANDAS     62
  34   MWS          5   PANDAS     60
  35   MWS          6   PANDAS     62
  36   MWS          7   PANDAS     71
  37   MWS          8   PANDAS     94
  38   MWS          9   PANDAS     63
  39   MWS         10   PANDAS     89),
 ('PYTHON',    Batch  StudentId HomeWork  Score
  20   MWS          1   PYTHON     76
  21   MWS          2   PYTHON     58
  22   MWS          3   PYTHON     70
  23   MWS          4   PYTHON     80
  24   MWS          5   PYTHON     98
  25   MWS          6   PYTHON     54
  26   MWS          7   PYTHON     67
  27   MWS          8   PYTHON     94
  28   MWS          9   PYTHON     81
  29   MWS         10   PYTHON     81),
 ('VBA',    Batch  StudentId HomeWork  Score
  10   MWS          1      VBA     60
  11   MWS          2      VBA     51
  12   MWS          3      VBA     89
  13   MWS          4      VBA     63
  14   MWS          5      VBA     85
  15   MWS          6      VBA     52
  16   MWS          7      VBA     75
  17   MWS          8      VBA     61
  18   MWS          9      VBA     69
  19   MWS         10      VBA     66)]

In [10]:
#Display all the Keys and data types in GroupedBy Column
DF_MWS.groupby(['HomeWork']).groups

{'Excel': Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64'),
 'PANDAS': Int64Index([30, 31, 32, 33, 34, 35, 36, 37, 38, 39], dtype='int64'),
 'PYTHON': Int64Index([20, 21, 22, 23, 24, 25, 26, 27, 28, 29], dtype='int64'),
 'VBA': Int64Index([10, 11, 12, 13, 14, 15, 16, 17, 18, 19], dtype='int64')}

In [11]:
#What if there are multiple columns that are grouped and we need to list all keys 
#and you want only the keys to be displayed
DF_MWS.groupby(['Batch','HomeWork']).groups.keys()

dict_keys([('MWS', 'Excel'), ('MWS', 'PANDAS'), ('MWS', 'PYTHON'), ('MWS', 'VBA')])

In [12]:
#Perform Aggregation on all "NUMERIC" columns at once
DF_MWS.groupby(['HomeWork']).sum()

          StudentId  Score
HomeWork
Excel            55    775
PANDAS           55    761
PYTHON           55    759
VBA              55    671

In [13]:
#What if we want the group but not replace the index column with the Key
DF_MWS.groupby(['HomeWork'], as_index=False).sum()

  HomeWork  StudentId  Score
0    Excel         55    775
1   PANDAS         55    761
2   PYTHON         55    759
3      VBA         55    671

In [14]:
#Perform Aggregation on one column
DF_MWS.groupby(['HomeWork'])['Score'].sum()

HomeWork
Excel     775
PANDAS    761
PYTHON    759
VBA       671
Name: Score, dtype: int64

In [15]:
#Perform Aggregation on more than 1 column. Pass the columns as list
DF_MWS.groupby(['HomeWork'])['Score','StudentId'].sum()

          Score  StudentId
HomeWork
Excel       775         55
PANDAS      761         55
PYTHON      759         55
VBA         671         55

In [16]:
srs_abc = DF_MWS.groupby(['Batch','HomeWork'])['Score'].sum() # produces Pandas Series
print(srs_abc)
print(isinstance(srs_abc,pd.DataFrame))
print(isinstance(srs_abc,pd.Series))

Batch  HomeWork
MWS    Excel       775
       PANDAS      761
       PYTHON      759
       VBA         671
Name: Score, dtype: int64
False
True

In [17]:
# Produces Pandas DataFrame because of the additional SQUARE Braces
DF_MWS.groupby(['Batch','HomeWork'])[['Score']].sum()

                Score
Batch HomeWork
MWS   Excel       775
      PANDAS      761
      PYTHON      759
      VBA         671

In [18]:
#Is there any other way to aggregate
#Columns after the aggregation function
DF_MWS.groupby(['Batch','HomeWork']).sum()[['Score']]

                Score
Batch HomeWork
MWS   Excel       775
      PANDAS      761
      PYTHON      759
      VBA         671

In [19]:
# What if we want to have different aggregations on different columns
# And we want to rename columns
DF_MWS.groupby(['Batch','HomeWork']).agg({'HomeWork':'count', 'Score':'sum'})

                HomeWork  Score
Batch HomeWork
MWS   Excel           10    775
      PANDAS          10    761
      PYTHON          10    759
      VBA             10    671

In [ ]:
#Different aggregation on same colum

In [20]:
# What if we want to have different aggregations on different columns
# And we want to rename columns
DF_MWS.groupby(['Batch','HomeWork']).agg({'HomeWork':'count', 'Score':'sum'}).rename(columns={'HomeWork': 'HomeWork_Count', 'Score': 'Score_Sum'})

                HomeWork_Count  Score_Sum
Batch HomeWork
MWS   Excel                 10        775
      PANDAS                10        761
      PYTHON                10        759
      VBA                   10        671

In [28]:
#How to get count of unique students
#Group the dataframe and get the count
#DF_MWS.StudentId.nunique()
#OR
#DF_MWS.nunique()
#OR
#student_count = len(DF_MWS['StudentId'].unique())

Batch         1
StudentId    10
HomeWork      4
Score        30
dtype: int64

In [29]:
#Concatenate DATAFRAMES
frames = [DF_MWS, DF_TTS]
#How to append to dataframes one below the other
result = pd.concat(frames, axis=0) #Axis 0 is default
print(result.head(2))
#How to append next to each other i.e. sideways similar to joins
result = pd.concat(frames, axis=1) #Axis 0 is default
print(result.tail(2))

  Batch  StudentId HomeWork  Score
0   MWS          1    Excel     74
1   MWS          2    Excel     65
   Batch  StudentId HomeWork  Score Batch  StudentId HomeWork  Score
38   MWS          9   PANDAS     63   TTS          9   PANDAS     82
39   MWS         10   PANDAS     89   TTS         10   PANDAS     96

In [23]:
#Whats the default column of Join & How to join on specific columns
#Concatenate DATAFRAMES
frames = [DF_MWS, DF_TTS]
#How to append to dataframes one below the other
result = pd.concat(frames, axis=1) #Axis 0 is default
print(result)

   Batch  StudentId HomeWork  Score Batch  StudentId HomeWork  Score
0    MWS          1    Excel     74   TTS          1    Excel     72
1    MWS          2    Excel     65   TTS          2    Excel     54
2    MWS          3    Excel     84   TTS          3    Excel     65
3    MWS          4    Excel     79   TTS          4    Excel     75
4    MWS          5    Excel     72   TTS          5    Excel     89
5    MWS          6    Excel     56   TTS          6    Excel     80
6    MWS          7    Excel     82   TTS          7    Excel     60
7    MWS          8    Excel     98   TTS          8    Excel     82
8    MWS          9    Excel     76   TTS          9    Excel     78
9    MWS         10    Excel     89   TTS         10    Excel     85
10   MWS          1      VBA     60   TTS          1      VBA     94
11   MWS          2      VBA     51   TTS          2      VBA     91
12   MWS          3      VBA     89   TTS          3      VBA     63
13   MWS          4      VBA     63   TTS          4      VBA     52
14   MWS          5      VBA     85   TTS          5      VBA     87
15   MWS          6      VBA     52   TTS          6      VBA     79
16   MWS          7      VBA     75   TTS          7      VBA     91
17   MWS          8      VBA     61   TTS          8      VBA     50
18   MWS          9      VBA     69   TTS          9      VBA     59
19   MWS         10      VBA     66   TTS         10      VBA     77
20   MWS          1   PYTHON     76   TTS          1   PYTHON     69
21   MWS          2   PYTHON     58   TTS          2   PYTHON     95
22   MWS          3   PYTHON     70   TTS          3   PYTHON     70
23   MWS          4   PYTHON     80   TTS          4   PYTHON     65
24   MWS          5   PYTHON     98   TTS          5   PYTHON     84
25   MWS          6   PYTHON     54   TTS          6   PYTHON     63
26   MWS          7   PYTHON     67   TTS          7   PYTHON     91
27   MWS          8   PYTHON     94   TTS          8   PYTHON     69
28   MWS          9   PYTHON     81   TTS          9   PYTHON     72
29   MWS         10   PYTHON     81   TTS         10   PYTHON     59
30   MWS          1   PANDAS     69   TTS          1   PANDAS     90
31   MWS          2   PANDAS    100   TTS          2   PANDAS     71
32   MWS          3   PANDAS     91   TTS          3   PANDAS     77
33   MWS          4   PANDAS     62   TTS          4   PANDAS     71
34   MWS          5   PANDAS     60   TTS          5   PANDAS     90
35   MWS          6   PANDAS     62   TTS          6   PANDAS     78
36   MWS          7   PANDAS     71   TTS          7   PANDAS     83
37   MWS          8   PANDAS     94   TTS          8   PANDAS     58
38   MWS          9   PANDAS     63   TTS          9   PANDAS     82
39   MWS         10   PANDAS     89   TTS         10   PANDAS     96

In [24]:
#If concatenate can join two dataframes side by side and one below another then why need merge
Merged_MWS_DF = pd.merge(DF_MWS_LookUP, DF_MWS, how="inner", on=["StudentId", "StudentId"])
Merged_MWS_DF.head(2)

  Batch_x  StudentId       Name Batch_y HomeWork  Score
0     MWS          1  MWS_STU_1     MWS    Excel     74
1     MWS          1  MWS_STU_1     MWS      VBA     60

In [25]:
#Create a new frame from all aggregations

summary = pd.DataFrame({"Total Students": [student_count], 
                                 "Total Homeworks": [student_count], 
                                 "Average Scores": [total_budget]})

NameError: name 'total_budget' is not defined